[
  {"id": "r1", "userId": "u1", "venueId": "g1", "rating": 5, "comment": "Absolutely the best gym in Dubai! The equipment is top-notch, staff is friendly, and the atmosphere is motivating. Been a member for 6 months and couldn't be happier.", "date": "2024-12-15", "helpful": 24, "response": {"businessReply": "Thank you Sarah! We're thrilled to have you as part of our FitZone family!", "date": "2024-12-16"}},
  {"id": "r2", "userId": "u2", "venueId": "g2", "rating": 5, "comment": "Perfect for serious lifters. The Olympic platforms are well-maintained, and they actually allow chalk! 24/7 access is a game-changer for my schedule.", "date": "2024-12-10", "helpful": 18, "response": null},
  {"id": "r3", "userId": "u3", "venueId": "l1", "rating": 5, "comment": "My go-to study spot. Quiet zones are actually quiet, the coffee is decent, and the WiFi is fast. Study rooms are worth booking in advance during exam season.", "date": "2024-12-12", "helpful": 31, "response": {"businessReply": "Glad we could support your studies, Emily! Best of luck with your exams!", "date": "2024-12-13"}},
  {"id": "r4", "userId": "u4", "venueId": "g1", "rating": 4, "comment": "Great gym overall. Only giving 4 stars because it can get crowded during peak hours (6-8pm). Early morning is the best time to go.", "date": "2024-12-08", "helpful": 15, "response": null},
  {"id": "r5", "userId": "u5", "venueId": "c3", "rating": 5, "comment": "Learned Python from scratch here. Alex is an amazing instructor who explains concepts clearly. The project-based approach really helped me understand real-world applications.", "date": "2024-12-05", "helpful": 22, "response": {"businessReply": "Thank you Lisa! It was a pleasure teaching you. Keep coding!", "date": "2024-12-06"}},
  {"id": "r6", "userId": "u6", "venueId": "g2", "rating": 4, "comment": "Raw, no-frills gym that has everything you need for strength training. Love the atmosphere and the dedicated lifting community here.", "date": "2024-12-01", "helpful": 12, "response": null},
  {"id": "r7", "userId": "u7", "venueId": "c1", "rating": 5, "comment": "Prof. Chen is exceptional! My daughter's math grades improved from C to A in just 3 months. Worth every dirham.", "date": "2024-11-28", "helpful": 45, "response": {"businessReply": "So happy to hear about your daughter's progress, Anna! Hard work pays off!", "date": "2024-11-29"}},
  {"id": "r8", "userId": "u8", "venueId": "g3", "rating": 5, "comment": "Found my zen here. Maya's hot yoga classes are incredible. The studio is beautiful with natural light and the energy is so positive.", "date": "2024-11-25", "helpful": 28, "response": null},
  {"id": "r9", "userId": "u9", "venueId": "l3", "rating": 5, "comment": "Hidden gem! Love the cozy atmosphere and the curated book selection. The artisan coffee is a bonus. Perfect for creative work and inspiration.", "date": "2024-11-20", "helpful": 19, "response": {"businessReply": "Thank you Jennifer! We love creating a space for creative minds.", "date": "2024-11-21"}},
  {"id": "r10", "userId": "u10", "venueId": "g1", "rating": 5, "comment": "Just joined last month and already seeing results. The personal trainers are knowledgeable and the group classes are fun. Highly recommend!", "date": "2024-11-15", "helpful": 8, "response": null},
  {"id": "r11", "userId": "u1", "venueId": "g3", "rating": 5, "comment": "Best yoga studio in Dubai Marina. Clean, peaceful, and the instructors are amazing. The meditation sessions have really helped with my stress.", "date": "2024-11-10", "helpful": 34, "response": null},
  {"id": "r12", "userId": "u2", "venueId": "c1", "rating": 5, "comment": "Preparing for IB Math HL here. The small batch sizes mean you get proper attention. Practice tests are exactly like the real exams.", "date": "2024-11-05", "helpful": 27, "response": null},
  {"id": "r13", "userId": "u3", "venueId": "c2", "rating": 4, "comment": "Learning Arabic here. Sofia is a patient teacher and the conversation practice is helpful. Wish they had more evening slots available.", "date": "2024-11-01", "helpful": 14, "response": {"businessReply": "Thanks for the feedback Emily! We're adding more evening slots next month.", "date": "2024-11-02"}},
  {"id": "r14", "userId": "u4", "venueId": "g5", "rating": 5, "comment": "Premium experience at Elite Lift. Yes, it's pricey, but you get what you pay for. Valet parking, towel service, spa access - it's like a members club.", "date": "2024-10-28", "helpful": 21, "response": null},
  {"id": "r15", "userId": "u5", "venueId": "g4", "rating": 4, "comment": "Great value for money! Clean gym, friendly staff, basic but well-maintained equipment. Perfect if you don't need fancy amenities.", "date": "2024-10-25", "helpful": 16, "response": null}
]
